1. Import the necessary libraries

In [9]:
import numpy as np
import pandas as pd

2. Import the dataset US_Baby_Names_right.csv

3. Assign it to a variable called baby_names

In [14]:
baby_names = pd.read_csv(r"C:\Users\valem\Downloads\Telegram Desktop\US_Baby_Names_right.csv")

In [16]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

4. See the first 10 entries

In [21]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

5. Delete the column 'Unnamed: 0' and 'Id'

In [25]:
baby_names.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

6. Are there more male or female names in the dataset?

In [31]:
baby_names["Gender"].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

7. Group the dataset by name and assign to names

In [36]:
baby_names[['Name', 'Count']].groupby("Name").sum().head(5)

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [39]:
baby_names[['Name', 'Count']].groupby("Name").sum().sort_values("Count", ascending = False).head(5)

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

8. How many different names exist in the dataset?

In [50]:
names = baby_names.groupby("Name").sum()
len(names)

17632

9. What is the name with most occurrences?

In [52]:
names.Count.idxmax()

'Jacob'

10. How many different names have the least occurrences?

In [55]:
len(names[names.Count == names.Count.min()])

2578

11. What is the median name occurrence?

In [61]:
names[names.Count == names.Count.median()]

         Unnamed: 0        Id   Year    Gender             State  Count
Name
Aishani     7810519   7810526  14078   FFFFFFF    CACACACACAILNJ     49
Alara      18841019  18841027  16079  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse     22629397  22629405  16057  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir      21780403  21780411  16086  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely       4349533   4349541  16071  FFFFFFFF  CACACACACACACACA     49
...             ...       ...    ...       ...               ...    ...
Sriram      9208196   9208203  14054   MMMMMMM    CACACACACACATX     49
Trinton    32822294  32822302  16069  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita       10241625  10241632  14075   FFFFFFF    CACACACACANYNY     49
Yoni        6439146   6439154  16060  MMMMMMMM  CACACACACACAFLFL     49
Zuleima     3521366   3521373  14050   FFFFFFF    AZCACACACACACA     49

[66 rows x 6 columns]

12. Get a summary with the mean, min, max, std and quartiles.

In [59]:
names.describe()

         Unnamed: 0            Id          Year          Count
count  1.763200e+04  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08  1.158117e+05    2008.932169
std    3.504512e+08  3.504513e+08  2.451618e+05   11006.069468
min    8.606400e+04  8.606500e+04  2.004000e+03       5.000000
25%    4.918374e+06  4.918375e+06  4.017000e+03      11.000000
50%    1.963462e+07  1.963463e+07  1.606100e+04      49.000000
75%    1.071826e+08  1.071826e+08  7.846425e+04     337.000000
max    3.223035e+09  3.223036e+09  2.233993e+06  242874.000000